go_timer.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2016-10-28 五 16:06 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="viewport" content="width=device-width, initial-scale=1" />
<title>go中的定时器timer</title>
<meta  name="generator" content="Org-mode" />
<link rel="stylesheet" type="text/css" href="./css/org-css.css"/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="index.html"> UP </a>
 |
 <a accesskey="H" href="index.html"> HOME </a>
</div><div id="content">
<h1 class="title">go中的定时器timer</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgheadline1">1. 使用方法</a></li>
<li><a href="#orgheadline2">2. 内部实现</a></li>
<li><a href="#orgheadline3">3. 其他实现方法</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgheadline1" class="outline-2">
<h2 id="orgheadline1"><span class="section-number-2">1</span> 使用方法</h2>
<div class="outline-text-2" id="text-1">
<p>
golang中定时器的使用接口在time包中，其中最主要两个接口是time.After跟,time.AfterFunc其中第一个After接口返回一个chan Time, 当时间到时可以读出Timer, AfterFunc接受一个方法，当时间到时执行这个方法。
</p>
<div class="org-src-container">

<pre class="src src-go"><span style="color: #F92672;">package</span> main

<span style="color: #F92672;">import</span> <span style="color: #AE81FF;">(</span>
  <span style="color: #E6DB74;">"time"</span>
  <span style="color: #E6DB74;">"fmt"</span>
<span style="color: #AE81FF;">)</span>

<span style="color: #F92672;">func</span> <span style="color: #A6E22E;">main</span><span style="color: #AE81FF;">()</span> <span style="color: #AE81FF;">{</span>
  a := time.<span style="color: #A6E22E;">After</span><span style="color: #66D9EF;">(</span><span style="color: #AE81FF;">2</span> * time.Second<span style="color: #66D9EF;">)</span>
  &lt;- a
  fmt.<span style="color: #A6E22E;">Println</span><span style="color: #66D9EF;">(</span><span style="color: #E6DB74;">"timer receive"</span><span style="color: #66D9EF;">)</span>

  time.<span style="color: #A6E22E;">AfterFunc</span><span style="color: #66D9EF;">(</span><span style="color: #AE81FF;">2</span> * time.Second, <span style="color: #F92672;">func</span><span style="color: #A6E22E;">(){</span>
    fmt.<span style="color: #A6E22E;">Println</span><span style="color: #E6DB74;">(</span><span style="color: #E6DB74;">"timer receive"</span><span style="color: #E6DB74;">)</span>
  <span style="color: #A6E22E;">}</span><span style="color: #66D9EF;">)</span>
<span style="color: #AE81FF;">}</span>
</pre>
</div>
<p>
After其实跟AfterFunc差不多，只不过其中的func参数是先通道中写数据
</p>
</div>
</div>

<div id="outline-container-orgheadline2" class="outline-2">
<h2 id="orgheadline2"><span class="section-number-2">2</span> 内部实现</h2>
<div class="outline-text-2" id="text-2">
<p>
由于After跟AfterFunc差不多，这里主要看看AfterFunc的实现
</p>
<div class="org-src-container">

<pre class="src src-go">  <span style="color: #75715E;">//</span><span style="color: #75715E;">time/sleep.go</span>
 <span style="color: #F92672;">func</span> <span style="color: #A6E22E;">AfterFunc</span><span style="color: #AE81FF;">(</span>d <span style="color: #66D9EF;">Duration</span>, f <span style="color: #F92672;">func</span><span style="color: #66D9EF;">()</span><span style="color: #AE81FF;">)</span> *<span style="color: #66D9EF;">Timer</span> <span style="color: #AE81FF;">{</span>
    t := &amp;<span style="color: #66D9EF;">Timer</span><span style="color: #66D9EF;">{</span>
      <span style="color: #AE81FF;">r</span>: <span style="color: #66D9EF;">runtimeTimer</span><span style="color: #A6E22E;">{</span>
        <span style="color: #AE81FF;">when</span>: <span style="color: #A6E22E;">when</span><span style="color: #E6DB74;">(</span>d<span style="color: #E6DB74;">)</span>,
        <span style="color: #AE81FF;">f</span>:    goFunc,
        <span style="color: #AE81FF;">arg</span>:  f,
      <span style="color: #A6E22E;">}</span>,
    <span style="color: #66D9EF;">}</span>
    <span style="color: #A6E22E;">startTimer</span><span style="color: #66D9EF;">(</span>&amp;t.r<span style="color: #66D9EF;">)</span>
    <span style="color: #F92672;">return</span> t
  <span style="color: #AE81FF;">}</span> 
  <span style="color: #F92672;">func</span> <span style="color: #A6E22E;">goFunc</span><span style="color: #AE81FF;">(</span>arg <span style="color: #F92672;">interface</span><span style="color: #66D9EF;">{}</span>, seq <span style="color: #66D9EF;">uintptr</span><span style="color: #AE81FF;">)</span> <span style="color: #AE81FF;">{</span>
    <span style="color: #F92672;">go</span> arg.<span style="color: #66D9EF;">(</span><span style="color: #F92672;">func</span><span style="color: #A6E22E;">()</span><span style="color: #66D9EF;">)()</span>
<span style="color: #AE81FF;">}</span>
</pre>
</div>
<p>
AfterFunc很简单，就是把参数封装为runtimeTimer,然后启动timer(把timer添加到队列中), 这部分代码在runtime/time.go中,注意这里goFunc新启动了一个goroutine来执行用户的任务,这样用户的func就不会堵塞timer
</p>

<div class="org-src-container">

<pre class="src src-go"><span style="color: #75715E;">//</span><span style="color: #75715E;">runtime/time.go</span>
  <span style="color: #F92672;">func</span> <span style="color: #A6E22E;">startTimer</span><span style="color: #AE81FF;">(</span>t *<span style="color: #66D9EF;">timer</span><span style="color: #AE81FF;">)</span> <span style="color: #AE81FF;">{</span>
    <span style="color: #F92672;">if</span> raceenabled <span style="color: #66D9EF;">{</span>
      <span style="color: #A6E22E;">racerelease</span><span style="color: #A6E22E;">(</span>unsafe.<span style="color: #A6E22E;">Pointer</span><span style="color: #E6DB74;">(</span>t<span style="color: #E6DB74;">)</span><span style="color: #A6E22E;">)</span>
    <span style="color: #66D9EF;">}</span>
    <span style="color: #A6E22E;">addtimer</span><span style="color: #66D9EF;">(</span>t<span style="color: #66D9EF;">)</span>
  <span style="color: #AE81FF;">}</span>

  <span style="color: #F92672;">func</span> <span style="color: #A6E22E;">addtimer</span><span style="color: #AE81FF;">(</span>t *<span style="color: #66D9EF;">timer</span><span style="color: #AE81FF;">)</span> <span style="color: #AE81FF;">{</span>
    <span style="color: #A6E22E;">lock</span><span style="color: #66D9EF;">(</span>&amp;timers.lock<span style="color: #66D9EF;">)</span>
    <span style="color: #A6E22E;">addtimerLocked</span><span style="color: #66D9EF;">(</span>t<span style="color: #66D9EF;">)</span>
    <span style="color: #A6E22E;">unlock</span><span style="color: #66D9EF;">(</span>&amp;timers.lock<span style="color: #66D9EF;">)</span>
  <span style="color: #AE81FF;">}</span>

  <span style="color: #75715E;">// </span><span style="color: #75715E;">Add a timer to the heap and start or kick the timer proc.</span>
  <span style="color: #75715E;">// </span><span style="color: #75715E;">If the new timer is earlier than any of the others.</span>
  <span style="color: #75715E;">// </span><span style="color: #75715E;">Timers are locked.</span>
  <span style="color: #F92672;">func</span> <span style="color: #A6E22E;">addtimerLocked</span><span style="color: #AE81FF;">(</span>t *<span style="color: #66D9EF;">timer</span><span style="color: #AE81FF;">)</span> <span style="color: #AE81FF;">{</span>
    <span style="color: #75715E;">// </span><span style="color: #75715E;">when must never be negative; otherwise timerproc will overflow</span>
    <span style="color: #75715E;">// </span><span style="color: #75715E;">during its delta calculation and never expire other runtime&#183;timers.</span>
    <span style="color: #F92672;">if</span> t.when &lt; <span style="color: #AE81FF;">0</span> <span style="color: #66D9EF;">{</span>
      t.when = <span style="color: #AE81FF;">1</span>&lt;&lt;<span style="color: #AE81FF;">63</span> - <span style="color: #AE81FF;">1</span>
    <span style="color: #66D9EF;">}</span>
    <span style="color: #75715E;">//</span><span style="color: #75715E;">&#28155;&#21152;time&#21040;&#20840;&#23616;timer</span>
    t.i = <span style="color: #F92672;">len</span><span style="color: #66D9EF;">(</span>timers.t<span style="color: #66D9EF;">)</span>
    timers.t = <span style="color: #F92672;">append</span><span style="color: #66D9EF;">(</span>timers.t, t<span style="color: #66D9EF;">)</span>
    <span style="color: #75715E;">//</span><span style="color: #75715E;">&#20351;&#29992;&#26368;&#23567;&#22534;&#31639;&#27861;&#32500;&#25252;timer&#38431;&#21015;</span>
    <span style="color: #A6E22E;">siftupTimer</span><span style="color: #66D9EF;">(</span>t.i<span style="color: #66D9EF;">)</span>
    <span style="color: #75715E;">//</span><span style="color: #75715E;">&#22914;&#26524;&#26159;&#31532;&#19968;&#20010;</span>
    <span style="color: #F92672;">if</span> t.i == <span style="color: #AE81FF;">0</span> <span style="color: #66D9EF;">{</span>
      <span style="color: #75715E;">// </span><span style="color: #75715E;">siftup moved to top: new earliest deadline.</span>
      <span style="color: #75715E;">//</span><span style="color: #75715E;">&#22914;&#26524;&#22312;sleep&#20013;, &#21796;&#37266;</span>
      <span style="color: #F92672;">if</span> timers.sleeping <span style="color: #A6E22E;">{</span>
        timers.sleeping = <span style="color: #AE81FF;">false</span>
        <span style="color: #A6E22E;">notewakeup</span><span style="color: #E6DB74;">(</span>&amp;timers.waitnote<span style="color: #E6DB74;">)</span>
      <span style="color: #A6E22E;">}</span>
      <span style="color: #75715E;">//</span><span style="color: #75715E;">&#22914;&#26524;&#22312;&#35843;&#24230;&#20013;, &#31561;&#24453;</span>
      <span style="color: #F92672;">if</span> timers.rescheduling <span style="color: #A6E22E;">{</span>
        timers.rescheduling = <span style="color: #AE81FF;">false</span>
        <span style="color: #A6E22E;">goready</span><span style="color: #E6DB74;">(</span>timers.gp, <span style="color: #AE81FF;">0</span><span style="color: #E6DB74;">)</span>
      <span style="color: #A6E22E;">}</span>
    <span style="color: #66D9EF;">}</span>
    <span style="color: #75715E;">//</span><span style="color: #75715E;">&#22914;&#26524;timer&#36824;&#27809;&#21019;&#24314;,&#21017;&#21019;&#24314;</span>
    <span style="color: #F92672;">if</span> !timers.created <span style="color: #66D9EF;">{</span>
      timers.created = <span style="color: #AE81FF;">true</span>
      <span style="color: #F92672;">go</span> <span style="color: #A6E22E;">timerproc</span><span style="color: #A6E22E;">()</span>
    <span style="color: #66D9EF;">}</span>
  <span style="color: #AE81FF;">}</span>

<span style="color: #F92672;">func</span> <span style="color: #A6E22E;">timerproc</span><span style="color: #AE81FF;">()</span> <span style="color: #AE81FF;">{</span>
  timers.gp = <span style="color: #A6E22E;">getg</span><span style="color: #66D9EF;">()</span>
  <span style="color: #F92672;">for</span> <span style="color: #66D9EF;">{</span>
    <span style="color: #A6E22E;">lock</span><span style="color: #A6E22E;">(</span>&amp;timers.lock<span style="color: #A6E22E;">)</span>
    timers.sleeping = <span style="color: #AE81FF;">false</span>
    now := <span style="color: #A6E22E;">nanotime</span><span style="color: #A6E22E;">()</span>
    delta := <span style="color: #A6E22E;">int64</span><span style="color: #A6E22E;">(</span>-<span style="color: #AE81FF;">1</span><span style="color: #A6E22E;">)</span>
    <span style="color: #F92672;">for</span> <span style="color: #A6E22E;">{</span>
      <span style="color: #F92672;">if</span> <span style="color: #F92672;">len</span><span style="color: #E6DB74;">(</span>timers.t<span style="color: #E6DB74;">)</span> == <span style="color: #AE81FF;">0</span> <span style="color: #E6DB74;">{</span>
        delta = -<span style="color: #AE81FF;">1</span>
        <span style="color: #F92672;">break</span>
      <span style="color: #E6DB74;">}</span>
      t := timers.t<span style="color: #E6DB74;">[</span><span style="color: #AE81FF;">0</span><span style="color: #E6DB74;">]</span>
      <span style="color: #75715E;">//</span><span style="color: #75715E;">&#24471;&#21040;&#21097;&#20313;&#26102;&#38388;, &#36824;&#27809;&#21040;&#26102;&#38388;&#23601;sleep</span>
      delta = t.when - now
      <span style="color: #F92672;">if</span> delta &gt; <span style="color: #AE81FF;">0</span> <span style="color: #E6DB74;">{</span>
        <span style="color: #F92672;">break</span>
      <span style="color: #E6DB74;">}</span>
      <span style="color: #75715E;">//</span><span style="color: #75715E;">&#22914;&#26524;&#26159;&#21608;&#26399;&#24615;&#30340;&#23601;&#31639;&#19979;&#19968;&#27425;&#26102;&#38388;</span>
      <span style="color: #F92672;">if</span> t.period &gt; <span style="color: #AE81FF;">0</span> <span style="color: #E6DB74;">{</span>
        <span style="color: #75715E;">// </span><span style="color: #75715E;">leave in heap but adjust next time to fire</span>
        t.when += t.period * <span style="color: #FD971F;">(</span><span style="color: #AE81FF;">1</span> + -delta/t.period<span style="color: #FD971F;">)</span>
        <span style="color: #75715E;">//</span><span style="color: #75715E;">&#26368;&#23567;&#22534;&#19979;&#27785;</span>
        <span style="color: #A6E22E;">siftdownTimer</span><span style="color: #FD971F;">(</span><span style="color: #AE81FF;">0</span><span style="color: #FD971F;">)</span>
      <span style="color: #E6DB74;">}</span> <span style="color: #F92672;">else</span> <span style="color: #E6DB74;">{</span>
        <span style="color: #75715E;">// </span><span style="color: #75715E;">remove from heap</span>
        <span style="color: #75715E;">//</span><span style="color: #75715E;">&#21024;&#38500;&#23558;&#35201;&#25191;&#34892;&#30340;timer,(&#26368;&#23567;&#22534;&#31639;&#27861;)</span>
        last := <span style="color: #F92672;">len</span><span style="color: #FD971F;">(</span>timers.t<span style="color: #FD971F;">)</span> - <span style="color: #AE81FF;">1</span>
        <span style="color: #F92672;">if</span> last &gt; <span style="color: #AE81FF;">0</span> <span style="color: #FD971F;">{</span>
          timers.t<span style="color: #F92672;">[</span><span style="color: #AE81FF;">0</span><span style="color: #F92672;">]</span> = timers.t<span style="color: #F92672;">[</span>last<span style="color: #F92672;">]</span>
          timers.t<span style="color: #F92672;">[</span><span style="color: #AE81FF;">0</span><span style="color: #F92672;">]</span>.i = <span style="color: #AE81FF;">0</span>
        <span style="color: #FD971F;">}</span>
        timers.t<span style="color: #FD971F;">[</span>last<span style="color: #FD971F;">]</span> = <span style="color: #AE81FF;">nil</span>
        timers.t = timers.t<span style="color: #FD971F;">[</span>:last<span style="color: #FD971F;">]</span>
        <span style="color: #F92672;">if</span> last &gt; <span style="color: #AE81FF;">0</span> <span style="color: #FD971F;">{</span>
          <span style="color: #A6E22E;">siftdownTimer</span><span style="color: #F92672;">(</span><span style="color: #AE81FF;">0</span><span style="color: #F92672;">)</span>
        <span style="color: #FD971F;">}</span>
        t.i = -<span style="color: #AE81FF;">1</span> <span style="color: #75715E;">// </span><span style="color: #75715E;">mark as removed</span>
      <span style="color: #E6DB74;">}</span>
      f := t.f
      arg := t.arg
      seq := t.seq
      <span style="color: #A6E22E;">unlock</span><span style="color: #E6DB74;">(</span>&amp;timers.lock<span style="color: #E6DB74;">)</span>
      <span style="color: #F92672;">if</span> raceenabled <span style="color: #E6DB74;">{</span>
        <span style="color: #A6E22E;">raceacquire</span><span style="color: #FD971F;">(</span>unsafe.<span style="color: #A6E22E;">Pointer</span><span style="color: #F92672;">(</span>t<span style="color: #F92672;">)</span><span style="color: #FD971F;">)</span>
      <span style="color: #E6DB74;">}</span>
      <span style="color: #75715E;">//</span><span style="color: #75715E;">&#25191;&#34892;&#20989;&#25968;&#35843;&#29992;&#20989;&#25968;</span>
      <span style="color: #A6E22E;">f</span><span style="color: #E6DB74;">(</span>arg, seq<span style="color: #E6DB74;">)</span>
      <span style="color: #A6E22E;">lock</span><span style="color: #E6DB74;">(</span>&amp;timers.lock<span style="color: #E6DB74;">)</span>
    <span style="color: #A6E22E;">}</span>
    <span style="color: #75715E;">//</span><span style="color: #75715E;">&#32487;&#32493;&#19979;&#19968;&#20010;,&#22240;&#20026;&#21487;&#33021;&#19979;&#19968;&#20010;timer&#20063;&#21040;&#26102;&#38388;&#20102;</span>
    <span style="color: #F92672;">if</span> delta &lt; <span style="color: #AE81FF;">0</span> || faketime &gt; <span style="color: #AE81FF;">0</span> <span style="color: #A6E22E;">{</span>
      <span style="color: #75715E;">// </span><span style="color: #75715E;">No timers left - put goroutine to sleep.</span>
      timers.rescheduling = <span style="color: #AE81FF;">true</span>
      <span style="color: #A6E22E;">goparkunlock</span><span style="color: #E6DB74;">(</span>&amp;timers.lock, <span style="color: #E6DB74;">"timer goroutine (idle)"</span>, traceEvGoBlock, <span style="color: #AE81FF;">1</span><span style="color: #E6DB74;">)</span>
      <span style="color: #F92672;">continue</span>
    <span style="color: #A6E22E;">}</span>
    <span style="color: #75715E;">// </span><span style="color: #75715E;">At least one timer pending.  Sleep until then.</span>
    timers.sleeping = <span style="color: #AE81FF;">true</span>
    <span style="color: #A6E22E;">noteclear</span><span style="color: #A6E22E;">(</span>&amp;timers.waitnote<span style="color: #A6E22E;">)</span>
    <span style="color: #A6E22E;">unlock</span><span style="color: #A6E22E;">(</span>&amp;timers.lock<span style="color: #A6E22E;">)</span>
    <span style="color: #75715E;">//</span><span style="color: #75715E;">&#27809;&#21040;&#26102;&#38388;,&#30561;&#30496;delta&#26102;&#38388;</span>
    <span style="color: #A6E22E;">notetsleepg</span><span style="color: #A6E22E;">(</span>&amp;timers.waitnote, delta<span style="color: #A6E22E;">)</span>
  <span style="color: #66D9EF;">}</span>
<span style="color: #AE81FF;">}</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline3" class="outline-2">
<h2 id="orgheadline3"><span class="section-number-2">3</span> 其他实现方法</h2>
<div class="outline-text-2" id="text-3">
<p>
以前也看过erlang的timer的实现，不过erlang的实现是使用时间轮的方式，不同的时间挂在不同的时间刻度上，而golang使用的最小堆维护的一个timer队列。总的来说golang的实现方式比较简单，erlang的方式比较复杂，但是erlang在支持比较大量的timer情况下比较好,效率比较高。而go比较费时，每次操作最坏情况下都是logn（n为时间队列长度）.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2016-10-28 五 16:06</p>
<p class="validation"></p>
</div>
</body>
</html>
